solver/ParticleladenChannelFlow/CFD/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (108 0 0)
    (108 36 0)
    (0 36 0)
    (0 0 23)
    (108 0 23)
    (108 36 23)
    (0 36 23)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) domain (144 48 30) simpleGrading (1 1 1)
);
 
edges
(
);

boundary
(
    top
    {
	type	wall;
	faces	((4 5 6 7));
    }

    front 
    {
	type		cyclic;
neighbourPatch	back;
	faces		((0 1 5 4));
    }

    back 
    {
	type		cyclic;
neighbourPatch	front;
	faces		((2 3 7 6));
    }

    left
	{
	type		cyclic;
	neighbourPatch	right;
	faces		((0 4 7 3));
    }

    right
	{
	type		cyclic;
	neighbourPatch	left;
	faces		((2 6 5 1));
    }
	
    base
    {
	type	     wall;
	faces
	(
		      (0 3 2 1)	
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
