solver/ParticleladenChannelFlow/CFD/system/singleGraph_height22d
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/
singleGraph_height22d
{
start   (0 0.00345 0.01518);
end     (0.0138 0.00345 0.01518);
fields  (U p);


// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.
// setConfig { type midPoint; }
setConfig
{
	//type  lineUniform;
	axis x;
	//nPoints 150;
}
// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}
// ************************************************************************* //
